# Задание 1
# Необходимо вывести имена всех учеников из списка с новой строки

# решение:
names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    print(name)

print("+++++++")
# Задание 2
# Необходимо вывести имена всех учеников из списка, рядом с именем показать количество букв в нём.

# решение:
names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    print(f"{name} {len(name)}")

print("+++++++")
# Задание 3
# Необходимо вывести имена всех учеников из списка, рядом с именем вывести пол ученика

is_male = {
  'Оля': False,  # если True, то пол мужской
  'Петя': True,
  'Вася': True,
  'Маша': False,
}

# решение:
names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    if is_male[name]:
        print(f"{name} мужского пола")
    else:
        print(f"{name} женского пола")

print("+++++++")
# Задание 4
# Даны группу учеников. Нужно вывести количество групп и для каждой группы – количество учеников в ней
# Пример вывода:
# Всего 2 группы.
# В группе 2 ученика.
# В группе 3 ученика.

groups = [
  ['Вася', 'Маша'],
  ['Оля', 'Петя', 'Гриша'],
]

# решение:
print(f"Всего {len(groups)} группы")
for group in groups:
    print(f"В группе {len(group)} ученика")

print("+++++++")
# Задание 5
# Для каждой пары учеников нужно с новой строки перечислить учеников, которые в неё входят.
# Пример:
# Группа 1: Вася, Маша
# Группа 2: Оля, Петя, Гриша

groups = [
  ['Вася', 'Маша'],
  ['Оля', 'Петя', 'Гриша'],
]

# решение:
for number, group in enumerate(groups):
    print(f"Группа {number + 1}: {', '.join(group)}")